# 1. Выбираем базовый образ с Python
FROM python:3.9-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл с зависимостями
COPY requirements.txt .

# 4. Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем все остальные файлы проекта (скрипт и шаблоны)
COPY . .

# 6. Сообщаем Docker, что наше приложение будет работать на порту 5000
EXPOSE 5000

# 7. Команда, которая будет запущена при старте контейнера
CMD ["gunicorn", "--bind", "0.0.0.0:5000", "app:app"]
